// Створити функцію getMaxDigit(number) – яка отримує будь-яке число та виводить найбільшу цифру в цьому числі. Приклади: 1236 -> 6, 987 -> 9, 385 -> 8 


const getMaxDigit = (num) => {
    return Math.max(...num.toString().split('') );    
};


//    Створити функцію, яка визначає ступінь числа. Не використовуючи Math.pow та **. Використовуйте цикл

let getPow = (x, n) => {
    let result = x;
    for (let i = 1; i < n; i++) {
    result *= x }

    return result;
};

//     Створити функцію, яка форматує ім'я, роблячи першу букву великою. ("влад" -> "Влад", "вЛАД" -> "Влад" і так далі);

const toCamel = (name) => {
    return name[0].toUpperCase() + name.slice(1).toLowerCase();
};

//     Створити функцію, яка вираховує суму, що залишається після оплати податку від зарабітньої плати. (Податок = 18% + 1.5% -> 19.5%). Приклад: 1000 -> 805

const calcProfit = (salary) => {
    return salary - (salary * ((18/100) + (1.5/100)))
}; 

//     Створити функцію, яка повертає випадкове ціле число в діапазоні від N до M. Приклад: getRandomNumber(1, 10) -> 5

const getRandomNum = (N, M) => {
       return Math.floor(Math.random() * (M - N + 1)) + N;  
}

//     Створити функцію, яка рахує скільки разів певна буква повторюється в слові. Приклад: countLetter("а", "Асталавіста") -> 4

const countSymbols = (symbol, word) => {
    let count = 0;
    word = word.toLowerCase();
    symbol = symbol.toLowerCase();
    
    for (let i = 0; i < word.lenght; i++) {
        if (symbol === word[i]) {
            count++;
          }
    }
    return count;
};







document.writeln(
`Функция №1: ${getMaxDigit(123456789)}; <br>
Функция №2: ${getPow(5, 9)}; <br> 
Функция №3: ${toCamel('параШюТ')}; <br> 
Функция №4: ${calcProfit(2500)}; <br> 
Функция №5: ${getRandomNum(2, 9)}; <br> 
Функция №6: ${countSymbols('ы','Сыктывкар')}; <br>
`)












/*



    Створити функцію, яка рахує скільки разів певна буква повторюється в слові. Приклад: countLetter("а", "Асталавіста") -> 4
    Створіть функцію, яка конвертує долари в гривні та навпаки в залежності від наявності символа $ або UAH в рядку. Приклад: convertCurrency("100$") -> 2500 грн. або convertCurrency("2500UAH") -> 100$
    Врахуйте, інші валюти не конвертуються, потрібно виводити помилку, і також регістр uah не має значення.
    Створіть функцію генерації випадкового паролю (тільки числа), довжина встановлюється користувачем або по замовчуванню = 8 символам.
    Приклад: getRandomPassword(4) -> 1875, getRandomPassword() -> 87240124
    Створіть функцію, яка видаляє всі букви з речення. Приклад: deleteLetters('a', "blablabla") -> "blblbl"
    Створіть функцію, яка перевіряє, чи є слово паліндромом. Приклад: isPalyndrom("мадам") -> true, isPalyndrom("кокос") -> false, isPalyndrom("Я несу гусеня") -> true
    Створіть функцію, яка видалить з речення букви, які зустрічаються більше 1 разу. Приклад: deleteDuplicateLetter("Бісквіт був дуже ніжним") -> "сктдеим"

    */